Revit 2024 API
UnitTypeId Class
 This class contains constants identifying units of measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static class UnitTypeId
Visual Basic
Public NotInheritable Class UnitTypeId
Visual C++
public ref class UnitTypeId abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UnitTypeId
See Also
UnitTypeId Members
Autodesk.Revit.DB Namespace